{
	"blogs": [{
			"title": "Rumination Over My First Month at NSS",
			"content": "<p>I'd like to use this blog for storage of concepts I've learned during my time at NSS, so without further ado, here is the list of topics covered this week!<li>Arrays</li><li>For Loops</li><li>Functions</li></p><p>In addition to a useful summary for future reference, there will also be lots of feelings (feels?) shared. </p><p>For the first two weeks of class I felt comfortable with everything that was going on while learning HTML and CSS. I have control over HTML, and  CSS makes me feel like Picasso. I thoroughly enjoy getting lost in CSS (this involves 2-3 cycles of: 1) Make things more design-y, 2) Love how it turned out, and 3) End up hating how it turned out and scrapping the whole style sheet)...I think I enter some sort of trance after about an hour, but I am pretty sure I am fully enjoying the process.</p><p>Javascript, however, makes me feel like I'm learning to walk again (an experience I don't remember but I am sure it was challenging). In a pretty short period I experienced a wide range of emotions around the process of learning--from helplessness, dejection and surprise, to determination, and anticipation of the next puzzle to solve. As for our in class assignments and homework, it definitely feels great to get to the solution, but the road there is not easy. Right now I am relying heavily on the awesome people in my studygroup to bounce ideas around. Thanks, eastside_and_down, you're keeping me going...</p>",
			"author": "Posted by Gina Antonini",
			"date": "July 30, 2017"
		},
		{
			"title": "GitHub 102",
			"content": "<p>The past two weeks were spently mainly learning more about GitHub, doing Javascript exercises, and learning how to work in teams. The Javascript exercises are getting increasingly difficult, but are still fun for me, so that's a good thing! I am still having a lot of difficulty figuring out the first steps for solving the exercises. One practice that has helped me a lot is seeking out extra exercises online so that I can get better at that. I'm still relying heavily on group time to get through the assignments.</p><p>Sometimes I find it hard to keep up with teammates because our skill levels are different but I try not to let it discourage me. After watching the in class demonstration of a group working through a GitHub project I realized how important it is to plan projects out when working with a team. And especially when trying to solve an assignment on my own.</p><p>Right now I am attempting to finish up the converter exercise. The end goal is to create a program that converts a temperature from celsius to farenheit and vice-versa. I think I finally have all of the functions needed to make the program work, but am struggling while trying to debug syntax errors, etc. Something I want to get better at is naming conventions for my variables and functions, as several times I confused myself and startied getting frustrated.</p>",
			"author": "Posted by Gina Antonini",
			"date": "August 6, 2017"
		},
		{
			"title": "GitHub Group Projects",
			"content": "<p>This week's group project was a great review of Javascript arrays as well as writing to the dom with a domString function. It really helps to put the objectives I've learned into a project to solidify what I've learned. For our group project we created a website for a company we made up called Teachers Touch. We were required to have a page that displayed products as cards as well as a page that displayed employees as cards. We used a Javascript function for each page that allowed us to easily post additional products and employees to the arrays we created. Each team member was also responsible for creating an additional page on the site--mine was the blog page. I used the same method of creating objects that I pushed into an array and printed to the dom. Separately I am also still working on the temperature converter program, which has me stuck currently.</p>",
			"author": "Posted by Gina Antonini",
			"date": "August 14, 2017"
		},
		{
			"title": "Event Listeners",
			"content": "Our topic the past two weeks has been event listeners. It's awesome to be able to use event listeners to add click features to the webpage exercises we have been working on. I finally feel like I can create something cool. I enjoyed the WYSIWYG exercise we did as it really tied together everything we have been learning.",
			"author": "Posted by Gina Antonini",
			"date": "August 29, 2017"
		},
		{
			"title": "XHR",
			"content": "This is where my XHR blog post will go.",
			"author": "Posted by Gina Antonini",
			"date": "September 1, 2017"
		},
		{
			"title": "Bootstrap",
			"content": "After learning about Bootstrap, I think moving forward I will pick and choose the parts of it that I want to use.  As a fan of CSS, I’m not extremely excited about the prospect of using Bootstrap. It seems to limit styling choices and makes the page look a little bland.  One aspect of Bootstrap that I do like is the grid system.  It really helps with simplifying the page layout and gives me a good visual of how to organize areas of the site.",
			"author": "Posted by Gina Antonini",
			"date": "September 4, 2017"
		},
		{
			"title": "Browserify",
			"content": "<p>Browserify allows you to create modular applications by compiling modules for the browser. I was intimidated by the setup of our first project using Browserify because of the steps involved. We were assigned creation of a sandwich menu app that allows the user to select the ingredients they want on the sandwich. After the ingredients have been selected the user should see the total cost for sandwich based on the ingredients selected.</p>",
			"author": "Posted by Gina Antonini",
			"date": "September 22, 2017"
		},
		{
			"title": "Jquery",
			"content": "This is where my Jquery blog post will go.",
			"author": "Posted by Gina Antonini",
			"date": "October 4, 2017"
		},
		{
			"title": "Promises",
			"content": "This is where my Promises blog post will go.",
			"author": "Posted by Gina Antonini",
			"date": "October 17, 2017"
		},
		{
			"title": "APIs",
			"content": "This is where my API blog post will go.",
			"author": "Posted by Gina Antonini",
			"date": "October 22, 2017"
		},
		{
			"title": "Firebase",
			"content": "This is where my Firebase post will go.",
			"author": "Posted by Gina Antonini",
			"date": "November 3, 2017"
		},
		{
			"title": "Theme Park Project",
			"content": "This is where my Theme Parks blog post will go.",
			"author": "Posted by Gina Antonini",
			"date": "November 11, 2017"
		}
	],

	"jobs": [{
			"company": "Metropolitan Property Management",
			"title": "Director of Operations",
			"dates": "November 2016 - Present",
			"description": "Metropolitan manages 90 residential and commercial buildings and homeowners associations. As Director of Operations I create the vision for systems and workflows while overseeing day-to-day business activity. I directly supervise intern and administrative staff while owning and overseeing several essential systems: operations, database, communications, and accounting. My responsibilities also extend to management of information systems to include data and software migrations and maintenance of websites.  Most importantly, I guide new clients through the first 90 days of the management contract.",
			"image": "./images/mpmlogo.jpg"
		},
		{
			"company": "Lucky Grain",
			"title": "Owner",
			"dates": "March 2015 - December 2017",
			"description": "Lucky Grain created artisan furniture from locally recycled tree waste. We met our goal to reduce landfill waste by reusing waste material for all client projects. As owner of Lucky Grain I managed all business activity including bookeeping, customer relations, social media management, material sourcing, machinery upkeep, and design and build on all projects.",
			"image": "./images/luckygrainlogo.jpg"
		},
		{
			"company": "Technology Advice",
			"title": "Program Manager",
			"dates": "October 2014 - March 2015",
			"description": "As Program Manager at a growing technology marketing company, my main objective ensured that all client orders were filled timely and that quality leads were delivered and formatted to customer satisfaction. Additionally I captured daily, weekly, and monthly revenue numbers at a company with average annual revenue of $9MM.",
			"image": "./images/technologyadvicelogo.png"
		},
		{
			"company": "Metropolitan Property Management",
			"title": "Operations Manager",
			"dates": "October 2012 - October 2014",
			"description": "As Operations Manager, my key responsibilities included maintaining day-to-day processes including accounting, client relations, legal, and tax compliance.  Under the direction of the company President, I created systems and processes that allowed the business to double in under two years.",
			"image": "./images/mpmlogo.jpg"
		}
	],

	"projects": [{
			"screenshot": "./images/themeparkscreenshot.png",
			"description": "Theme Park Map: For this project, students were divided into groups of four and tasked with creating an interactive map of a theme park. This was an exercise for using Promises, Jquery, Sass, Firebase, and Browserify. The park is organized into 7 areas. Various attractions are located within each area. On page load you'll see a list of all attractions open at the current time. By clicking on a specific area, you will see a list of the attractions within that area of the park on the left side of the screen. You will not see any attractions that are out of order or under maintenance.",
			"github": "<a>https://themepark-map.firebaseapp.com/</a>"
		},
		{
			"screenshot": "./images/chattycucumbers.png",
			"description": "Chatty Message Board: Here is a basic message board that allows the user to add a message, delete a message, and edit a message.",
			"github": "<a>https://github.com/nss-evening-cohort-06/chatty-flying-cucumbers</a>"
		},
		{
			"screenshot": "./images/wysiwyg.png",
			"description": "WYSIWYG: This was a individual project and exercise in click events and keypress events.",
			"github": "<a>https://github.com/GinaAntonini/wysiwyg</a>"
		}
	]
}